"Please Donate" = "Lūdzu ziedo";
"Donate" = "Ziedo";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Ir ziedots daudz laika, lai izveidotu šo programmu. Ja Tev tā patīk, lūdzu atbalsti ar ziedojumu Kiber Pīles autoru. Ziedojums palīdzēs Kiber Pīlei tapt vēl labākai!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Kā Kiber Pīles atbalstītājs, Jūs saņēmāt ziedojuma atslēgu, kas atslēgs mudinājumu ziedot.";
"Thank you for using Cyberduck!" = "Paldies ka izvēlējies Kiber Pīli!";
"Later" = "Nākamreiz";
"Don't show again for this version" = "Vairāk nerādīt ar šo versiju";
"Registration Key" = "Ziedojuma atslēga";

"Buy in Windows Store" = "Buy in Windows Store";
"Buy in Mac App Store" = "Buy in Mac App Store";
